## esg_se_xdr_demo_prod plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.oauth_client.module.oauth_client.tfe_oauth_client.this must be replaced
-/+ resource "tfe_oauth_client" "this" {
      ~ id               = "oc-Tu1t9KmeUbimZoCc" -> (known after apply)
        name             = "Terraform Cloud - esg_se_xdr_demo_prod_development"
      ~ oauth_token      = (sensitive value) # forces replacement
      ~ oauth_token_id   = "ot-PgvDkdcFvoMhVQhH" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.organization.module.organization.tfe_organization.this[0] will be updated in-place
  ~ resource "tfe_organization" "this" {
      ~ cost_estimation_enabled                                 = false -> true
        id                                                      = "esg_se_xdr_demo_prod_development"
        name                                                    = "esg_se_xdr_demo_prod_development"
        # (5 unchanged attributes hidden)
    }

  # module.workspace.module.workspace.tfe_workspace.this will be updated in-place
  ~ resource "tfe_workspace" "this" {
      ~ execution_mode                = "remote" -> "local"
        id                            = "ws-jaM3bBDZB5QoB9bf"
        name                          = "org_workspace_development"
      ~ operations                    = true -> (known after apply)
      ~ trigger_prefixes              = [
+           "",
        ]
        # (15 unchanged attributes hidden)

      ~ vcs_repo {
          ~ oauth_token_id     = "ot-PgvDkdcFvoMhVQhH" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```